# MAC store Apps
mas "OmniFocus 3", id: 1346203938 # OmniFocus 3
mas "Goodnotes 5", id: 1444383602 # Goodnotes 5
mas "flycut", id: 442160987 # flycut
mas "tweetdeck", id: 485812721 # tweetdeck
mas "Focus", id: 777233759 # Focus
mas "Slack", id: 803453959 # Slack
mas "iStat mini", id: 927292435 # iStat mini
mas "Amphetamine", id: 937984704 # Amphetamine
mas "Grammarly", id: 1462114288 # Grammarly
# mas "Zoom", id: 414329397

# Casks
# cask "google-chrome"
# cask "soucretree"
cask "visual-studio-code"
# cask "zoomus"
cask "1password"
cask "1password/tap/1password-cli"
cask "alfred"
cask "cheatsheet"
cask "docker"
cask "dropbox"
cask "gitkraken"
cask "iterm2"
cask "jitsi-meet"
cask "monitorcontrol"
cask "obs"
cask "rectangle"
cask "spotify"
cask "sengi"


# Brews
# brew "hidetatz/tap/kubecolor"
brew "autoconf"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "boot2docker"
brew "consul"
brew "csvkit"
brew "dagger/tap/dagger-cue"
brew "dive"
brew "docker-machine"
brew "fzf"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "git"
brew "go"
brew "heroku"
brew "hstr"
brew "htop"
brew "httpie"
brew "hugo"
brew "hugo"
brew "istioctl"
brew "jq"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "loginitems"
brew "mas"
brew "miller"
brew "molecule"
brew "nmap"
brew "openssl"
brew "packer"
brew "pipenv"
brew "pulumi/tap/pulumi"
brew "pv"
brew "pwgen"
brew "pyenv-virtualenv"
brew "pyenv"
brew "python"
brew "ripgrep"
brew "slack-cli"
brew "starship"
brew "staticcheck"
brew "steampipe"
brew "terraform-inventory"
brew "tfenv"
brew "tflint"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "vault"
brew "wget"
brew "yadm"
brew "yq"
brew "zsh-syntax-highlighting"
brew "zsh"
# Taps
# tap "OJFord/formulae"
# tap "rockymadden/rockymadden"
