

# MAC store Apps
# mas "Zoom", id: 414329397
mas "Amphetamine", id: 937984704 # Amphetamine
mas "flycut", id: 442160987 # flycut
mas "Grammarly", id: 1462114288 # Grammarly
mas "iStat mini", id: 927292435 # iStat mini
mas "Slack", id: 803453959 # Slack
mas "mastonaut", id: 1450757574 # mastonaut
mas "omnifocus-4", id: 1542143627 # omnifocus-4
mas "tailscale", id: 1475387142 # tailscale

# Taps
tap "buo/cask-upgrade"
tap "common-fate/granted"
tap "hashicorp/tap"
# tap "homebrew/cask-fonts"
tap "OJFord/formulae"

# tap "rockymadden/rockymadden"

# Casks

# cask "docker"
# cask "mutedeck"
# cask "soucretree"
cask "1password"
cask "1password/tap/1password-cli"
cask "alfred"
cask "cheatsheet"
cask "dropbox"
cask "elgato-stream-deck"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-for-powerline"
cask "font-meslo-lg-nerd-font"
cask "font-powerline-symbols"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "gitkraken"
cask "iterm2"
cask "jitsi-meet"
cask "monitorcontrol"
cask "obs"
cask "obsidian"
# cask "outrigdev/outrig/outrig"
cask "rancher"
cask "rectangle"
cask "sengi"
cask "spotify"
cask "utm"
cask "visual-studio-code"


# Brews
brew "act"
brew "aquaproj/aqua/aqua"
brew "argocd"
brew "atuin"
brew "autoconf"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "boot2docker"
brew "copier"
brew "csvkit"
brew "dagger/tap/dagger-cue"
brew "dive"
brew "docker-machine"
brew "fd"
brew "findutils"
brew "fnm"
brew "fx"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "git"
brew "go-jira"
brew "go-task/tap/go-task"
brew "go"
brew "granted"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/vault"
brew "helm"
brew "hstr"
brew "htop"
brew "httpie"
brew "hugo"
brew "istioctl"
brew "jq"
brew "k9s"
brew "knqyf263/pet/pet"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "loginitems"
brew "lsd"
brew "mas"
brew "miller"
brew "mise"
brew "molecule"
brew "nmap"
brew "openssl"
brew "packer"
brew "peak/tap/s5cmd"
brew "pipenv"
brew "pipx"
brew "pulumi/tap/pulumi"
brew "pv"
brew "pwgen"
brew "pyenv-virtualenv"
brew "pyenv"
brew "python"
brew "ripgrep"
brew "skaffold"
brew "sslscan"
brew "starship"
brew "staticcheck"
brew "steampipe"
brew "terraform-inventory"
brew "terraformer"
brew "tfenv"
brew "tflint"
brew "tfmcp"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "vault"
brew "viddy" # watch replacement
brew "watch"
brew "wget"
brew "yadm"
brew "yq"
brew "zsh-syntax-highlighting"
brew "zsh"

